testAme/labs/lab4/combustor2D_lowRe_highT/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

deltaT		1e-7;

stopAt          endTime;

endTime         0.30;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

functions
{
	#includeFunc	residuals(p,U,k,epsilon)
	#include	"functionObjects/forces"
	#include	"functionObjects/integralValues"
	#include	"functionObjects/surfaces"
	Mach
        {
		        type MachNo;
		        enabled yes;
		        libs ("libfieldFunctionObjects.so");
		        writeControl  writeTime;
			writeInterval 1;
	}
}
